trade_exp/src/Documents/ПриходныйОрдерНаТовары/ПриходныйОрдерНаТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6a90e124-5af0-4a37-8ff7-14481b8cb2dd">
  <name>ПриходныйОрдерНаТовары</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.ДвижениеМаркированногоТовара</registerRecords>
  <attributes extendedConfigurationObject="c9e23b65-d2dd-4d5e-91a1-60a62757322c">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a3dfe1b-75d0-4247-8d64-84bab203cf9c">
    <name>Отправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bbce78e7-d91d-4dac-8a0c-b47e64d9325b">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9cd3d95f-95cb-4f59-909e-802e5579ac5b">
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8762c46f-68da-4109-a1f4-fb201e69cf69">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f481b21a-9531-4e52-9957-c494f5e377f6">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0f355e-967b-4aef-9cf3-b95cc9fdfcef">
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d0368be3-8269-42f8-b1e8-5a902ab8fbd0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95326fc6-5780-440a-84af-cd29440e2b58">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ca8589c8-0a63-4506-aa59-5684f62c08c1">
    <name>ЗонаПриемки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8a679cf3-b805-4f49-bee6-d93a2702e946">
    <name>СкладскаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b49b6320-3833-4d7e-9256-844ccbfa090e">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="06e8c720-eb9f-425a-9716-baef1a36e9a3">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0cdca97b-7d3f-41b0-a49d-95b6449dd7ac">
    <name>РежимПросмотраПоТоварам</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="efa8b93c-791b-4449-99fd-217a3baf3df6">
    <name>ВсегоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4979558b-bd14-48f3-a52d-805e31ec5e65">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5dcdee8c-9444-4bd3-ae94-e55f618ed216">
    <name>Распоряжение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8187f1a4-6517-4240-ace4-08511908ce30">
    <name>ВходящийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4c33a3ea-7a9b-4d40-8f7d-a7581e73da16">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="193cb4c0-81db-49ab-a130-d34f2a776519">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="eeb10de4-4d97-4473-b2ac-e752ff3ab390">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="9dd9c28c-0ab6-479c-907f-118c9feac29e">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="fa78140c-0253-4803-87da-cf38870a1ab3">
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8496f61d-538d-4d21-80c3-b273a1617696">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="55fb4905-a811-46e2-9192-771e2fb958cc">
      <name>УпаковочныйЛист</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75fac7f0-d3fd-4458-a727-7598962ea772">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="75e84f0f-f847-4153-b485-7a92a831f94b">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1f572790-edb3-4f4d-b716-aac43eeb7c85">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4b9edd5-b41d-4b6b-86c5-b4d3896e8b32">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="4058b5f7-fa3b-4b4e-abe9-cf3afe19677f">
    <name>ШтрихкодыУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f4ff2bf1-a8d5-487c-98fc-c15da9a88779">
      <name>ШтрихкодУпаковки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/AccumulationRegisters/ЗапасыИПотребности/ЗапасыИПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f8b7177a-e10e-497a-870e-8a0109117431">
  <name>ЗапасыИПотребности</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2a3239b5-c939-45ab-a821-679e4fe02b0c">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fa84dffb-fc50-40db-b9e9-2eecc08d3aff">
    <name>Поступит</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="fd2c8e08-d7c5-41b1-a555-e61c7ec66966">
    <name>Заказано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="63b04ee8-431e-43e1-86d7-a31699fe5f9d">
    <name>РезервироватьНаСкладе</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="7db60568-8a3c-4c91-ad5b-f1c37f1dff6d">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bdd58b52-8895-40cb-9462-86ee07c1a418">
    <name>ОтложитьРезервирование</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="4256427c-6117-4032-b24a-fe3fe80b3479">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="6ed35275-b9d3-4183-ac57-ab470c9070ce">
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="f01cba2a-6eee-4608-be77-4081299421fb">
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9fa49e04-61ac-4854-abc9-81a226d49748">
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc3a9a0c-ce39-4e09-95b3-5cf269ade3af">
    <name>ОтгружаемыйЗаказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4de10a7f-26fe-4a6f-9977-b6f11b54f8a7">
    <name>ТипЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad05a33b-3278-43a0-ab32-a3fbf95febd2">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="52036866-218a-40f1-b620-3bf0ad8c374a">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="851d8e29-0692-4d7d-bb5f-869fa0f442e4">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4d50d363-128e-4a9e-874f-dcd55a5764b3">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="795b0906-d397-48a6-a53a-d642ad9d07db">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="294f1bc8-ab72-47b2-ab6b-23004cf40406">
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6f8a11b2-8bda-4fd8-8728-ed5d380f935a">
    <name>ДатаСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ПриходныйОрдерНаТовары/Forms/ФормаДокумента/Module.bsl
#Область Доработки_по_ордерной_схеме

&НаСервере
&ИзменениеИКонтроль("ПриЧтенииСозданииНаСервере")
Процедура Док_ПриЧтенииСозданииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Распоряжение) Тогда
		ОбщегоНазначенияУТКлиентСервер.ДобавитьПараметрВыбора(Элементы.Склад, "Ссылка", Документы.ПриходныйОрдерНаТовары.ОрдерныеСклады(Объект));
	КонецЕсли;
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Склад, Помещение",Объект.Склад, Объект.Помещение));
	
	РозничныйВидЦены        = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Склад, "РозничныйВидЦены");
	
	УстановитьПривилегированныйРежим(Истина);
	Если ЗначениеЗаполнено(Объект.Распоряжение) Тогда 
		ОрганизацияРаспоряжения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Распоряжение, "Организация");
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ПараметрыУказанияСерий = Новый ФиксированнаяСтруктура(НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.ПриходныйОрдерНаТовары));
	
	УстановитьЗависимыеОтАдресногоХранения();
	
	Элементы.ГруппаИнформация.Картинка = ОбщегоНазначенияКлиентСервер.КартинкаКомментария(Объект.Комментарий);
	
	Элементы.Помещение.Видимость = СкладыСервер.ИспользоватьСкладскиеПомещения(Объект.Склад,Объект.Дата);
	
	Если Объект.СкладскаяОперация = Перечисления.СкладскиеОперации.ВозвратНепринятыхТоваров
		Или Объект.СкладскаяОперация = Перечисления.СкладскиеОперации.ВозвратНепринятыхТоваровУстарел Тогда
		Элементы.ДатаВходящегоДокумента.Видимость  = Ложь;
		Элементы.НомерВходящегоДокумента.Видимость = Ложь;
		
		Элементы.ЗаполнитьВозвращаемоеКоличество.Видимость    = Истина;
		Элементы.ЗаполнитьТолькоКоличество.Видимость          = Ложь;
		Элементы.ЗаполнитьТолькоНоменклатуру.Видимость        = Ложь;
		Элементы.ЗаполнитьНоменклатуруИКоличество.Видимость   = Ложь;
		Элементы.ТоварыЗаполнитьСерииПоРаспоряжению.Видимость = Ложь;
		Элементы.ТоварыПроверитьКоличество.Видимость          = Ложь;
		Элементы.РаспоряжениеПредставление.Видимость          = Ложь;
	Иначе
		Элементы.РаспоряжениеПредставление.Видимость = Истина;
		Элементы.ТоварыДокументОтгрузки.Видимость    = Ложь;
		
		Элементы.ЗаполнитьВозвращаемоеКоличество.Видимость    = Ложь;
		
		Элементы.ТоварыДобавитьИзДокументовОтгрузки.Видимость = Ложь;
	КонецЕсли;
	
	#Удаление 
	ИспользоватьУпаковки              = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	#КонецУдаления
	#Вставка
	ИспользоватьУпаковки = Ложь;
	 
	Если ЗначениеЗаполнено(Объект.Распоряжение) Тогда
		 
		ТипРаспоряжения = ТипЗнч(Объект.Распоряжение); 
		 
		Элементы.Товары_ЗаблокироватьВсёНаБракОтПокупателей.Видимость = ?(ТипРаспоряжения = Тип("ДокументСсылка.ЧекККМВозврат") ИЛИ ТипРаспоряжения = Тип("ДокументСсылка.ВозвратТоваровОтКлиента") ИЛИ ТипРаспоряжения = Тип("ДокументСсылка.КорректировкаРеализации"),Истина,Ложь);
		 
	КонецЕсли;
	 
	Элементы.Форма_ИзменитьРаспоряжение.Видимость = АльтерраОбщегоНазначения._РольДоступна("ИзменениеРаспоряженияВПриходныхОрдерахНаТовары");
	#КонецВставки
	Элементы.СписокУпаковок.Видимость = ИспользоватьУпаковки;
	Элементы.НаборУпаковок.Видимость  = ИспользоватьУпаковки;
	
	Элементы.СписокШтрихКодовСоздатьШтрихКод.Видимость = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);
	Элементы.СписокШтрихКодовПечать.Видимость = ПравоДоступа("Просмотр", Метаданные.Обработки.ПечатьЭтикетокИЦенников);
	
	УпаковочныеЛистыСервер.ПриЧтенииСозданииФормыСУпаковочнымиЛистами(ЭтаФорма, Объект.Товары,
		Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	ЗаполнитьСлужебныеРеквизитыТЧТовары(Ложь);
	
	ОтобразитьСтраницуФильтраСнятьОтборПриНеобходимости();
	
	ВозможноЗаполнениеСерийПоРаспоряжению = Документы.ПриходныйОрдерНаТовары.ВозможноЗаполнениеСерийПоРаспоряжению(Объект, Ложь);
	
	ПоказатьПредставлениеРаспоряжения(РаспоряжениеПредставление, Объект.Распоряжение);
	
	РаботаСТабличнымиЧастями.ИнициализироватьКэшСтрок(Элементы.Товары);
КонецПроцедуры

&НаКлиенте
Процедура Док_ПослеЗаписиПосле(ПараметрыЗаписи)
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыПриходныхОрдеров.Принят") Тогда
		Результат = ПроверитьНеобходимостьЗапускаБП(Объект.Ссылка);
		Если Результат Тогда  
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
    		ПоказатьВопрос(Оповещение, "В документе присутствует ""Неопознанная номенклатура"", запустить БП в Битриксе?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("Автотест_ЗаполнитьПоРаспоряжениюФрагмент")
Процедура Док_Автотест_ЗаполнитьПоРаспоряжениюФрагмент(Знач ВидЗаполнения)
	
	#Удаление
	ПараметрыФормыВыбораДаты = Новый Структура;
	ПараметрыФормыВыбораДаты.Вставить("ТекущийДокумент",	Объект.Ссылка);
	ПараметрыФормыВыбораДаты.Вставить("Распоряжение",		Объект.Распоряжение);
	ПараметрыФормыВыбораДаты.Вставить("Склад",				Объект.Склад);
	
	ПараметрыОповещения	= Новый Структура("ВидЗаполнения", ВидЗаполнения);
	ОписаниеОповещения	= Новый ОписаниеОповещения("Автотест_ЗаполнитьПоРаспоряжениюЗавершение",
	ЭтотОбъект,
	ПараметрыОповещения);
	
	ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.ФормаВыбораДатыПоступления",
	ПараметрыФормыВыбораДаты,
	,
	,
	,
	,
	ОписаниеОповещения,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	#КонецУдаления
	
	#Вставка
	ДатаПоступления = ТекущаяДата();
	
	ЗаполнитьНаСервере(ВидЗаполнения,ДатаПоступления,КэшированныеЗначения);
	#КонецВставки
КонецПроцедуры

#Область НеопознанныйТовар  

&НаКлиенте
Процедура Док__ДобавитьНеопознанныйТоварПосле(Команда)
	
	НеопознанныйТовар = ПолучитьНеопознанныйТовар();
		
	Если ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		Оповещение = Новый ОписаниеОповещения("ДобавитьНеопознанныйТоварЗавершение", ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Номенклатура", НеопознанныйТовар);
		ПараметрыФормы.Вставить("ЗаказПоставщику", Объект.Распоряжение); 
		ПараметрыФормы.Вставить("ПриходныйОрдерНаТовары", Объект.Ссылка);
		
		ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.Док_НеопознаннаяНоменклатура", ПараметрыФормы, ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		ДобавитьНеопознанныйТоварЗавершение(НеопознанныйТовар, Неопределено);
	КонецЕсли; 
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьНеопознанныйТовар()
	
	НоменклатураНеопознанная = Справочники.Номенклатура.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НеопНоменклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК НеопНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗапасыИПотребностиОстатки.Номенклатура КАК Номенклатура,
	|			СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток) КАК ВНаличииОстаток,
	|			СУММА(ЗапасыИПотребностиОстатки.ВНаличииОстаток - ЗапасыИПотребностиОстатки.РезервироватьПоМереПоступленияОстаток - ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК Свободно,
	|			СУММА(ЗапасыИПотребностиОстатки.РезервироватьНаСкладеОстаток) КАК Резерв
	|		ИЗ
	|			РегистрНакопления.ЗапасыИПотребности.Остатки(
	|					,
	|					Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|						И Склад = &Склад) КАК ЗапасыИПотребностиОстатки
	|		ГДЕ
	|			ЗапасыИПотребностиОстатки.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			И ЗапасыИПотребностиОстатки.Склад = &Склад
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ЗапасыИПотребностиОстатки.Номенклатура) КАК СвободныеОстаткиОстатки
	|		ПО (СвободныеОстаткиОстатки.Номенклатура = НеопНоменклатура.Ссылка)
	|ГДЕ
	|	НеопНоменклатура.НеопознанныйТовар = ИСТИНА
	|	И НеопНоменклатура.ПометкаУдаления = ЛОЖЬ
	|	И ЕСТЬNULL(СвободныеОстаткиОстатки.ВНаличииОстаток, 0) = 0";
	
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоменклатураНеопознанная = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;

	Если НоменклатураНеопознанная.Пустая() Тогда
		НоменклатураНеопознанная = СоздатьНовуюНеопознаннуюНоменклатуру();
	КонецЕсли;
	
	Возврат НоменклатураНеопознанная;
	
КонецФункции

Функция СоздатьНовуюНеопознаннуюНоменклатуру()

	УстановитьПривилегированныйРежим(Истина);

	Попытка
		НачатьТранзакцию();
		
		НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();	
		СсылкаНового = Справочники.Номенклатура.ПолучитьСсылку();
		НоваяНоменклатура.УстановитьСсылкуНового(СсылкаНового);
		СсылкаНовойНоменклатуры = НоваяНоменклатура.ПолучитьСсылкуНового();

		НоваяНоменклатура.Наименование = "Неопознанная номенклатура (" + Строка(Объект.Номер) + " " + Строка(ТекущаяДата()) + ")"; 
		НоваяНоменклатура.Родитель = Справочники.Номенклатура.НайтиПоНаименованию("Неопознанно");
	    НоваяНоменклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Новый товар");
		НоваяНоменклатура.НеопознанныйТовар = ИСТИНА;
		НоваяНоменклатура.Качество = Перечисления.ГрадацииКачества.Новый;
		
		Справочники.Номенклатура.ЗаполнитьРеквизитыПоВидуНоменклатуры(НоваяНоменклатура);

	    НоваяНоменклатура.Записать();

        ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат СсылкаНовойНоменклатуры;  
	
КонецФункции

&НаКлиенте
Процедура ДобавитьНеопознанныйТоварЗавершение(НеопознанныйТовар, ДопПараметры) Экспорт 
	
	Если НеопознанныйТовар <> Неопределено Тогда 
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = НеопознанныйТовар; 
		НоменклатураПриИзмененииСервер(КэшированныеЗначения);
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти 

&НаКлиенте
Процедура Док__ПодобратьТоварыПосле(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Склад) Тогда
		
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Поле ""Склад"" не заполнено'"), Объект.Ссылка, "Объект.СкладОтправитель");
		Возврат;
		
	КонецЕсли;

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Склад",                                     Объект.Склад);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",         Истина);
	ПараметрыФормы.Вставить("СкрыватьКолонкуВидЦены",                    Истина);
	ПараметрыФормы.Вставить("СкрыватьКомандуЦеныНоменклатуры",           Истина);
	ПараметрыФормы.Вставить("ОтборПоТипуНоменклатуры",                   Новый ФиксированныйМассив(НоменклатураКлиентСервер.ОтборПоТоваруМногооборотнойТаре(Ложь)));
	ПараметрыФормы.Вставить("Заголовок",                                 НСтр("ru = 'Подбор товаров'"));
	ПараметрыФормы.Вставить("Дата",                                      Объект.Дата);
	ПараметрыФормы.Вставить("Документ",                                  Объект.Ссылка);
	ПараметрыФормы.Вставить("ПараметрыУказанияСерий",                    ПараметрыУказанияСерий);
	
	ОткрытьФорму("Обработка.ПодборТоваровВДокументПродажи.Форма", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура Док_ОбработкаВыбораПосле(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументПродажи.Форма.Форма" Тогда

		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)

	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	//СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	//СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		
		ТекущаяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрокаТовара, "Номенклатура, Характеристика, ХарактеристикиИспользуются, Упаковка, КоличествоУпаковок,Количество");
		//ОбновитьОтклоненияОтЗаказаВСтроке(ТекущаяСтрока, Объект.ПеремещениеПоЗаказам);
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
		//ТекущаяСтрока.ЗаказНаПеремещение = ЗаказВСтрокеСверхЗаказа(Объект.ПеремещениеПоЗаказам, Объект.ЗаказНаПеремещение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаполнитьПоРаспоряжениюПосле(Команда)
	ЗаполнитьПоРаспоряжениюБезУчетаДанныхПоОтгрузки();
КонецПроцедуры

Процедура ЗаполнитьПоРаспоряжениюБезУчетаДанныхПоОтгрузки()
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("Распоряжение", Объект.Распоряжение);
	Запрос.УстановитьПараметр("Отправитель", Объект.Отправитель);
	Запрос.УстановитьПараметр("РабочийУчасток", Объект.РабочийУчасток);
	
	Если ЗначениеЗаполнено(Объект.Дата) Тогда
		Запрос.УстановитьПараметр("ДатаОстатков", КонецДня(Объект.Дата));
	Иначе
		Запрос.УстановитьПараметр("ДатаОстатков", Объект.Дата);
	КонецЕсли;
	
	Объект.Товары.Очистить();
	
	ТекстЗапроса =
	    "ВЫБРАТЬ
		|	ТоварыКПоступлению.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлению.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТоварыКПоступлению.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
		|			ТОГДА ТоварыКПоступлению.Назначение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|	КОНЕЦ КАК Назначение,
		|	СУММА(ТоварыКПоступлению.Количество) КАК Количество,
		|	СУММА(ТоварыКПоступлению.Количество) КАК КоличествоУпаковок
		|ИЗ
		|	(ВЫБРАТЬ
		|		ТоварыКПоступлению.Номенклатура КАК Номенклатура,
		|		ТоварыКПоступлению.Характеристика КАК Характеристика,
		|		ТоварыКПоступлению.Назначение КАК Назначение,
		|		ТоварыКПоступлению.КОформлениюОрдеровОстаток - ТоварыКПоступлению.ПринимаетсяОстаток КАК Количество
		|	ИЗ
		|		РегистрНакопления.ТоварыКПоступлению.Остатки(
		|				&ДатаОстатков,
		|				ДокументПоступления = &Распоряжение
		|					И Отправитель = &Отправитель
		|					И Склад = &Склад) КАК ТоварыКПоступлению
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ТоварыКПоступлению.Номенклатура,
		|		ТоварыКПоступлению.Характеристика,
		|		ТоварыКПоступлению.Назначение,
		|		ВЫБОР
		|			КОГДА ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ТоварыКПоступлению.КОформлениюОрдеров
		|			ИНАЧЕ ТоварыКПоступлению.КОформлениюОрдеров
		|		КОНЕЦ - ВЫБОР
		|			КОГДА ТоварыКПоступлению.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА -ТоварыКПоступлению.Принимается
		|			ИНАЧЕ ТоварыКПоступлению.Принимается
		|		КОНЕЦ
		|	ИЗ
		|		РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
		|	ГДЕ
		|		ТоварыКПоступлению.Регистратор = &Ссылка
		|		И ТоварыКПоступлению.Активность
		|		И ТоварыКПоступлению.Склад = &Склад
		|		И ТоварыКПоступлению.ДокументПоступления = &Распоряжение) КАК ТоварыКПоступлению
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО (ТоварыКПоступлению.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
		|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочийУчасток
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыКПоступлению.Номенклатура,
		|	ТоварыКПоступлению.Характеристика,
		|	ТоварыКПоступлению.Назначение,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ТоварыКПоступлению.Назначение.ДвиженияПоСкладскимРегистрам, ЛОЖЬ)
		|			ТОГДА ТоварыКПоступлению.Назначение
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
		|	КОНЕЦ
		|
		|ИМЕЮЩИЕ
		|	СУММА(ТоварыКПоступлению.Количество) > 0";
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		
		Объект.Товары.Загрузить(Результат.Выгрузить());
		НоменклатураСервер.РазбитьТоварыПоТоварнымМестам(Объект.Товары);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Нет товаров для заполнения по распоряжению ""%Распоряжение%"" от отправителя %Отправитель%.'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Распоряжение%", Объект.Распоряжение);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Отправитель%", Объект.Отправитель);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Распоряжение");
		
	КонецЕсли;
	
	ВсегоМест = УпаковочныеЛистыСервер.КоличествоМестВТЧ(Объект.Товары);
	

КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьВсёНаСервере(ПричинаБлокировки)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Объект.Проведен Тогда
		
		БлокировкиПоПриходномуОрдеру = Альтерра_СкладСервер.ПолучитьБлокировкиПоОснования(Объект.Ссылка).Выгрузить();
		
		Если БлокировкиПоПриходномуОрдеру.Количество() = 0 Тогда
			
			ДокументБлокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент();
			
			ПараметрыЗаполнения = Новый Структура();
			ПараметрыЗаполнения.Вставить("Дата", Объект.Дата);
			ПараметрыЗаполнения.Вставить("Склад",Объект.Склад);
			ПараметрыЗаполнения.Вставить("ДокументОснование",Объект.Ссылка);
			ПараметрыЗаполнения.Вставить("Статус",Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано);
			ПараметрыЗаполнения.Вставить("ПричинаБлокировки",Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию(ПричинаБлокировки));
			ПараметрыЗаполнения.Вставить("Комментарий","Создан по кнопке 'Заблокировать всё на брак'");
			ПараметрыЗаполнения.Вставить("Товары",Объект.Товары);
			
			Альтерра_СкладСервер.СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировки,ПараметрыЗаполнения);
			
		Иначе
			Сообщить("По данному основанию уже созданы блокировки движения товаров!");
		КонецЕсли;
		
	Иначе
		Сообщить("Документ не проведен!");
	КонецЕсли;

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаблокироватьВсёНаБракОтПокупателейПосле(Команда)
	ЗаблокироватьВсёНаСервере("Брак от покупателей");
КонецПроцедуры


&НаКлиенте
Процедура Док__СортировкаПоЯчейкеПосле(Команда)
	СортировкаПоЯчейке();
КонецПроцедуры

&НаСервере
Процедура СортировкаПоЯчейке()
	
	Если Объект.Товары.Количество()>0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
		|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
		|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ВнешняяТаблицаНоменклатуры.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
		|	ВнешняяТаблицаНоменклатуры.Штрихкод КАК Штрихкод,
		|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
		|	ВнешняяТаблицаНоменклатуры.Комментарий КАК Комментарий,
		|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
		|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
		|ИЗ
		|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.Наименование КАК ЯчейкаНаименование,
		|	ВнешняяТаблицаНоменклатуры.Назначение КАК Назначение,
		|	ВнешняяТаблицаНоменклатуры.Упаковка КАК Упаковка,
		|	ВнешняяТаблицаНоменклатуры.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВнешняяТаблицаНоменклатуры.СтатусУказанияСерий КАК СтатусУказанияСерий,
		|	ВнешняяТаблицаНоменклатуры.ДокументОтгрузки КАК ДокументОтгрузки,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛист КАК УпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.УпаковочныйЛистРодитель КАК УпаковочныйЛистРодитель,
		|	ВнешняяТаблицаНоменклатуры.Штрихкод КАК Штрихкод,
		|	ВнешняяТаблицаНоменклатуры.ЭтоУпаковочныйЛист КАК ЭтоУпаковочныйЛист,
		|	ВнешняяТаблицаНоменклатуры.ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста КАК ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста,
		|	ВнешняяТаблицаНоменклатуры.Комментарий КАК Комментарий,
		|	ВнешняяТаблицаНоменклатуры.Серия КАК Серия
		|ИЗ
		|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЯчейкаНаименование";
		
		Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",Объект.Товары.Выгрузить());
		Запрос.УстановитьПараметр("Склад",Объект.Склад);
				
		Объект.Товары.Очистить();
        Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура Док__ИзменитьРаспоряжениеПослеНаКлиенте(ВыбранноеЗначение, Параметры) Экспорт
	Док__ИзменитьРаспоряжениеПослеНаСервере(ВыбранноеЗначение,Параметры);
КонецПроцедуры

&НаСервере
Процедура Док__ИзменитьРаспоряжениеПослеНаСервере(ВыбранноеЗначение, Параметры) 
	УстановитьПривилегированныйРежим(Истина);
	Если ВыбранноеЗначение <> Неопределено Тогда
		
		ДокументОбъект = Объект.Ссылка.ПолучитьОбъект();
		
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ВыбранноеЗначение);
		
		СкладскаяОперация = СкладыКлиентСервер.СкладскаяОперацияПриемкиПоХозяйственнойОперации(ДокументОбъект.ХозяйственнаяОперация);
		
		Если СкладскаяОперация <> Объект.СкладскаяОперация Тогда
			ДокументОбъект.СкладскаяОперация = СкладскаяОперация;
		КонецЕсли;
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура Док__ИзменитьРаспоряжениеПосле(Команда)
	ПараметрыФормыВыбораРаспоряжения = Новый Структура;
	ПараметрыФормыВыбораРаспоряжения.Вставить("Склад", Объект.Склад);
	ПараметрыФормыВыбораРаспоряжения.Вставить("Отправитель", Объект.Отправитель);
	ПараметрыФормыВыбораРаспоряжения.Вставить("ХозяйственнаяОперация", Объект.ХозяйственнаяОперация);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("Док__ИзменитьРаспоряжениеПослеНаКлиенте", ЭтотОбъект);
		
	ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.ВыборРаспоряжения",
						ПараметрыФормыВыбораРаспоряжения,
						ЭтотОбъект,
						,
						,
						,
						ОписаниеОповещения,
						РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
&Перед("ПередЗаписью")
Процедура Док_ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.СостояниеЗаполненияМногооборотнойТары=ПредопределенноеЗначение("Перечисление.СостоянияЗаполненияМногооборотнойТары.НеПредлагатьЗаполнить");
конецПроцедуры

&НаКлиенте
&Перед("ИзменитьКачествоНоменклатурыЗавершение")
Процедура Док_ИзменитьКачествоНоменклатурыЗавершение(Результат, ДополнительныеПараметры)
	Если ЗначениеЗаполнено(Результат.Назначение) И СтрНайти(Строка(Результат.Номенклатура), "н/к") > 0 Тогда
		Результат.Назначение = Неопределено;
	КонецЕсли;
КонецПроцедуры

#Область Блокировка

&НаСервере
Функция СозданНаОсновеПеремещенияТоваров()
    Если ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
        Возврат Истина;
    Иначе 
        Возврат Ложь;
    КонецЕсли
КонецФункции

&НаСервере
Процедура СоздатьБлокировку(ПричинаБлокировки, Комментарий)
	УстановитьПривилегированныйРежим(Истина);

	ДокументБлокировки = Документы.БлокировкаДвиженияТоваров.СоздатьДокумент();
	
	ПараметрыЗаполнения = Новый Структура();
	ПараметрыЗаполнения.Вставить("Дата", ТекущаяДата());
	ПараметрыЗаполнения.Вставить("Склад",Объект.Склад);
	ПараметрыЗаполнения.Вставить("ДокументОснование",Объект.Ссылка);
	ПараметрыЗаполнения.Вставить("Статус",Перечисления.СтатусыБлокировкиДвиженияНоменклатуры.Заблокировано);
	ПараметрыЗаполнения.Вставить("ПричинаБлокировки",Справочники.ПричиныБлокировкиДвиженияТоваров.НайтиПоНаименованию(ПричинаБлокировки));
	ПараметрыЗаполнения.Вставить("Комментарий", Комментарий);
  
	ПараметрыЗаполнения.Вставить("Товары", ПолучитьТЗТовары(Элементы.Товары.ВыделенныеСтроки));
	
	Альтерра_СкладСервер.СоздатьИзменитьБлокировкуДвиженияТоваров(ДокументБлокировки,ПараметрыЗаполнения, Истина);
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

&НаСервере
Функция ПолучитьТЗТовары(мТовары)
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура");
	ТЗ.Колонки.Добавить("Характеристика");
	ТЗ.Колонки.Добавить("КоличествоУпаковок");
    Для Каждого стр Из мТовары Цикл         
         Остатки = Альтерра_СкладСервер.ПолучитьОстатки(Объект.Товары[стр].Номенклатура, Объект.Товары[стр].Характеристика, Объект.Склад);
         Разница = Остатки - Объект.Товары[стр].КоличествоУпаковок;
         Если Разница > 0 Тогда
            ЗаполнитьЗначенияСвойств(ТЗ.Добавить(), Объект.Товары[стр]);
         Иначе   
            НС = ТЗ.Добавить();
            ЗаполнитьЗначенияСвойств(НС, Объект.Товары[стр]);
            НС.КоличествоУпаковок = Остатки;   
         КонецЕсли;	 
	КонецЦикла;
	Возврат ТЗ;
КонецФункции

#КонецОбласти  

#Область БпПоНеопознаннойНоменклатуре

&НаСервереБезКонтекста 
Функция ПроверитьНеобходимостьЗапускаБП(Ссылка)
	
	Возврат Документы.ПриходныйОрдерНаТовары.ПроверитьНеобходимостьЗапускаБП(Ссылка);  
	
КонецФункции

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗапуститьБпПоНеопознаннойНоменклатуре(Объект.Ссылка, Объект.Распоряжение, Объект.РабочийУчасток);	
	КонецЕсли;	
 
КонецПроцедуры 

&НаСервереБезКонтекста 
Процедура ЗапуститьБпПоНеопознаннойНоменклатуре(Ссылка, Распоряжение, РабочийУчасток)
	
	Документы.ПриходныйОрдерНаТовары.ЗапуститьБпПоНеопознаннойНоменклатуре(Ссылка, Распоряжение, РабочийУчасток);  
	
КонецПроцедуры

&НаКлиенте
Процедура Док_ЗаполнитьПоРегиструМППосле(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветЗаполнениеПоРегистру", ЭтаФорма);
	ТекстВопроса = "Дозаполнить только необработанные строки?";
   	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если ОбменУТМПСервер.ОрдерЗаполнялсяВМП(Объект.Ссылка, Объект.Распоряжение) Тогда
		Элементы.ТоварыЗаполнитьПоРегиструМП.Видимость = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветЗаполнениеПоРегистру(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отработаные = Ложь;
	Иначе
		Отработаные = Истина;	
	КонецЕсли;
	БылиИзменения = Док_ЗаполнитьПоРегиструМППослеНаСервере(Отработаные);
	Если БылиИзменения Тогда
		ЭтаФорма.Модифицированность = Истина;
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьОтветОчисткаПустыхСтрок", ЭтаФорма);
		ТекстВопроса = "Очистить неотработанные строки?";
	   	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Док_ЗаполнитьПоРегиструМППослеНаСервере(Отработаные) 
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	БылиИзменения = ОбменУТМПСервер.ЗаполнитьОрдер(ДокОбъект, "Товары", Отработаные); 
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект"); 
	Возврат БылиИзменения;
КонецФункции 

&НаКлиенте
Процедура ОбработатьОтветОчисткаПустыхСтрок(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОбработатьОтветОчисткаПустыхСтрокНаСервере();
	КонецЕсли;	 	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтветОчисткаПустыхСтрокНаСервере() 
	
	МассивСтрок = Объект.Товары.НайтиСтроки(Новый Структура("КоличествоУпаковок",0));
	Для Каждого Строка Из МассивСтрок Цикл
		Объект.Товары.Удалить(Строка);
	КонецЦикла;	
	
КонецПроцедуры


#КонецОбласти
